trade_exp/src/DataProcessors/РабочееМестоКладовщикаАльтерра/РабочееМестоКладовщикаАльтерра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочееМестоКладовщикаАльтерра</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОтгрузки</name>
      <type>
        <types>DefinedType.РаспоряжениеНаОтгрузку</types>
      </type>
    </attributes>
    <attributes>
      <name>УпаковочныйЛист</name>
      <type>
        <types>DocumentRef.УпаковочныйЛист</types>
      </type>
    </attributes>
    <attributes>
      <name>УпаковочныйЛистРодитель</name>
      <type>
        <types>DocumentRef.УпаковочныйЛист</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоУпаковочныйЛист</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Ссылка</name>
      <type>
        <types>DocumentRef.ПриходныйОрдерНаТовары</types>
      </type>
    </attributes>
    <attributes>
      <name>Распоряжение</name>
      <type>
        <types>DefinedType.РаспоряжениеНаПоступление</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

trade_exp/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Наш</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="a9733f12-e26b-44d6-8c73-49b629ab1280">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/AccumulationRegisters/ЗапасыИПотребности/ЗапасыИПотребности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f8b7177a-e10e-497a-870e-8a0109117431">
  <name>ЗапасыИПотребности</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2a3239b5-c939-45ab-a821-679e4fe02b0c">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fa84dffb-fc50-40db-b9e9-2eecc08d3aff">
    <name>Поступит</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fd2c8e08-d7c5-41b1-a555-e61c7ec66966">
    <name>Заказано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="63b04ee8-431e-43e1-86d7-a31699fe5f9d">
    <name>РезервироватьНаСкладе</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="7db60568-8a3c-4c91-ad5b-f1c37f1dff6d">
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="bdd58b52-8895-40cb-9462-86ee07c1a418">
    <name>ОтложитьРезервирование</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="4256427c-6117-4032-b24a-fe3fe80b3479">
    <name>КОбеспечению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="6ed35275-b9d3-4183-ac57-ab470c9070ce">
    <name>НеОбеспечивать</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="f01cba2a-6eee-4608-be77-4081299421fb">
    <name>ЗакрытьГрафикПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9fa49e04-61ac-4854-abc9-81a226d49748">
    <name>ЗакрытьГрафикОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cc3a9a0c-ce39-4e09-95b3-5cf269ade3af">
    <name>ОтгружаемыйЗаказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4de10a7f-26fe-4a6f-9977-b6f11b54f8a7">
    <name>ТипЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ad05a33b-3278-43a0-ab32-a3fbf95febd2">
    <name>Сторно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="52036866-218a-40f1-b620-3bf0ad8c374a">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="851d8e29-0692-4d7d-bb5f-869fa0f442e4">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4d50d363-128e-4a9e-874f-dcd55a5764b3">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="795b0906-d397-48a6-a53a-d642ad9d07db">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="294f1bc8-ab72-47b2-ab6b-23004cf40406">
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6f8a11b2-8bda-4fd8-8728-ed5d380f935a">
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЦеныНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="ef115090-8fca-4521-9bd1-ecc07f568bec">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="3a3a65ce-80a9-435f-9aa2-21d5add59229">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="aa1025d7-0232-4124-8a64-816e44306389">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/РазмещениеНоменклатурыПоСкладскимЯчейкам/РазмещениеНоменклатурыПоСкладскимЯчейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РазмещениеНоменклатурыПоСкладскимЯчейкам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ОсновнаяЯчейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7150e659-c510-45e5-9deb-fddf7441e996">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ЭлектроннаяОчередьКлиентов/ЭлектроннаяОчередьКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d8c9c294-870a-44ea-8c5a-f42a13a7459f">
  <name>ЭлектроннаяОчередьКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="7bf41d18-a27a-4fba-80a3-8f6785279797">
    <name>ЧастичноОтгружен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="b0a91b44-0e01-4076-bc0a-e247692c423d">
    <name>Заехал</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="e7944fb5-14d5-41da-8470-3a465f450b0b">
    <name>ОтметкаКассы</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="99ad658e-788e-4122-b16a-fcaa62283677">
    <name>ТребуетсяОповещениеКладовщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="0e22a688-0adf-48bf-b768-8d362798bfa0">
    <name>ПолучательУведомления</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="801d9ec6-cb3c-4867-98c2-4afaa72c9673">
    <name>СтатусОрдера</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="5dccbe81-f872-46d5-a8a5-30af95c1f5d6">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="d26f016a-39dd-4378-824e-bb04999f6b10">
    <name>ССайта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="5888bede-9c96-4076-b99f-977e4a559fc0">
    <name>НомерДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="f75ffc24-34ae-4ec8-92d2-90c5ccaaa229">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="16ef9874-783e-49a8-bbc6-59fbe7b17586">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f3371cf8-1d4f-43fc-a7ad-e3e827a6f002">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/DataProcessors/РабочееМестоКладовщикаАльтерра/Forms/ФормаПроверкаЦенников/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Сотрудник") Тогда
		Сотрудник = Параметры.Сотрудник;
		Склад = Сотрудник.Склад;
		Подразделение = Сотрудник.Подразделение;
		
		ЭтоКладовщик = ?(Сотрудник.РольМобильногоКлиента = Перечисления.РолиМобильногоКлиента.Кладовщик,Истина,Ложь);
		
		//+ Для тестов
		//ЭтоКладовщик = Истина;
		//-
	Иначе
		Отказ = Истина;
	КонецЕсли;  
	
	 Если ЭтоКладовщик Тогда
		
		ЭтаФорма.Заголовок = "Проверить остатки";
		
		СекцииСотрудника = Сотрудник.РабочиеУчастки.Выгрузить();
		Если СекцииСотрудника.Количество()>0 Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДоступныеЯчейки, "РабочийУчасток", СекцииСотрудника.ВыгрузитьКолонку("РабочийУчасток"), ВидСравненияКомпоновкиДанных.ВСписке,,Истина);	
		КонецЕсли;
		
	КонецЕсли; 
	Если АльтерраОбщегоНазначения.ПолучитьОграничениеДоступностиОстатков() Тогда
		Для каждого Секция Из Сотрудник.РабочиеУчастки Цикл
			Если Секция.РабочийУчасток.СкрытьКоличествоПоУчету Тогда
				Элементы.ГруппаОстаток.Видимость = Ложь;
				ЭтаФорма.Заголовок = "Карточка товара с АХ";
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	//Подключение оповещений из очереди
	СообщениеОбработано = Истина;
	Если ЭлектроннаяОчередьНаСекции() Тогда //Если у секции нет флага ЭлектроннаяОчередь, то ее подключение на ТСД не нужно 
		Если Не ПолучитьСостояниеОповещений() Тогда
			ОповещенияИзОчереди = Истина;
		Иначе
			ОповещенияИзОчереди = Сотрудник.ОповещенияИзОчереди; 
		КонецЕсли;
	Иначе 
		ОповещенияИзОчереди = Ложь; 	
	КонецЕсли; 
	Инт = 60;    
	СекцииСотрудника = СекцииСотрудника();
	Для каждого Стр Из СекцииСотрудника Цикл
		ЗнчИнтервала = Стр.Значение.ИнтервалОповещений;
		Если ЗнчИнтервала <> 0 И Инт > ЗнчИнтервала Тогда
			Инт = ЗнчИнтервала;
		КонецЕсли; 
	КонецЦикла; 
	ИнтервалОповещений = Инт;

	//+
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма); 
	//-

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//+
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено,ЭтаФорма, "СканерШтрихкода");
	//-                  
	Если ОповещенияИзОчереди Тогда
		Элементы.ГруппаСписокОчереди.Видимость = Истина; 
		ПодключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди", 10, Ложь);
		ПроверкаЭлектроннойОчереди(); 
	Иначе 
		Элементы.ГруппаСписокОчереди.Видимость = Ложь;	
	КонецЕсли;
	ИнициализироватьСканер();
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьСканер()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		
		Попытка   //+
			глВКRSDriver.УстановитьПараметр("Barcode_BEEP",Истина);
			глВКRSDriver.УстановитьПараметр("Barcode_BZZ",Истина);
			глВКRSDriver.Подключить("Barcode");	
		Исключение //-
		КонецПопытки; //-

		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьСканер()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		
		Попытка
			глВКRSDriver.Отключить("Barcode");	
		Исключение
		КонецПопытки;
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник) 
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "Barcode" Тогда
			Если ТипЗнч(Параметр) = Тип("Массив") Тогда
				Штрихкод1 =  Параметр;
			иначе
				Штрихкод1 = Новый Массив;
				Штрихкод1.Добавить(Параметр);
				Штрихкод1.Добавить(Неопределено);
			конецесли;
			
			Данные = ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Штрихкод1);
			
			Штрихкод = Данные.Штрихкод;
			
			Если ПустаяСтрока(Штрихкод) Тогда
				Элементы.Декорация1.Заголовок = "Не удалось прочитать штрихкод! Считайте штрихкод еще раз!";
				Элементы.Декорация1.ЦветТекста= WebЦвета.Красный;
				Если ЭтоКладовщик Тогда
					Элементы.ГруппаСклад.Видимость=Ложь;
				Иначе
					Элементы.ГруппаНоменклатура.Видимость=Ложь;
				КонецЕсли;
				Возврат;
			КонецЕсли;
			
			Если Элементы.ГруппаСклад.Видимость = Ложь И Элементы.ВыборЯчейки.Видимость = Истина Тогда
				 ОбработатьШтрихкод(Штрихкод1[0]);
			КонецЕсли;
			
			СтруктураДанных = НоменклатураПоШтрихкоду(Штрихкод,Подразделение,Склад);
			
			Если ЗначениеЗаполнено(СтруктураДанных.Номенклатура)  Тогда
				Номенклатура = СтруктураДанных.Номенклатура; 
				Характеристика = СтруктураДанных.Характеристика; 
				ТочкаПересчета = СтруктураДанных.ТочкаПересчета;
				Упаковка =  СтруктураДанных.Упаковка; 
				ОстатокТЗ =  СтруктураДанных.ОстаткиТЗ;
				ОстатокНаСкладе = СтруктураДанных.ОстатокНаСкладе;
				Ячейка = СтруктураДанных.Ячейка;
				ЦенаПоКарте = СтруктураДанных.ЦенаПоКарте; 
				ЦенаБезКарты = СтруктураДанных.ЦенаБезКарты;
				Попытка
					ПолучитьАдресКартинки(Номенклатура);
				Исключение
				КонецПопытки;
				
				Элементы.Декорация1.Видимость = Ложь;
				Если ЭтоКладовщик Тогда
					Элементы.ГруппаСклад.Видимость=Истина;
				Иначе
					Элементы.ГруппаНоменклатура.Видимость=Истина;
				КонецЕсли;
			Иначе
				Элементы.Декорация1.Заголовок = "Не удалось прочитать штрихкод! Считайте штрихкод еще раз!";
				Элементы.Декорация1.ЦветТекста= WebЦвета.Красный;
				Если ЭтоКладовщик Тогда
					Элементы.ГруппаСклад.Видимость=Ложь;
				Иначе
					Элементы.ГруппаНоменклатура.Видимость=Ложь;
				КонецЕсли;
				Возврат;
			КонецЕсли;
			
			
			
		КонецЕсли;
	КонецЕсли;
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

&НаСервереБезКонтекста
Функция НоменклатураПоШтрихкоду(ШтрихкодНоменклатуры,Подразделение,Склад)
	
	СтруктураДанныхОтвета = Новый Структура("Номенклатура,Характеристика,ТочкаПересчета, Упаковка,ОстаткиТЗ,ЦенаБезКарты,ЦенаПоКарте,ОстатокНаСкладе,Ячейка",,,,,);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
	|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка,
	|	ТочкиПересчетаОбучение.Наименование КАК ТочкаПересчета
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТочкиПересчетаОбучение КАК ТочкиПересчетаОбучение
	|			ПО ВидыНоменклатуры.ТочкаПересчетаОбучение = ТочкиПересчетаОбучение.Ссылка
	|		ПО ШтрихкодыНоменклатуры.Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_Номенклатура.Характеристика КАК Характеристика,
	|	ВТ_Номенклатура.ТочкаПересчета КАК ТочкаПересчета,
	|	ВТ_Номенклатура.Упаковка КАК Упаковка,
	|	РаспределениеЗапасов.ВНаличии - РаспределениеЗапасов.Резерв КАК ОстаткиТЗ,
	|	ЦенаБезКарты.Цена КАК ЦенаБезКарты,
	|	ЦенаПоКарте.Цена КАК ЦенаПоКарте,
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ОстатокНаСкладе,
	|	ТоварыНаСкладахОстатки.Склад КАК Склад,
	|	ТоварыНаСкладахОстатки.Помещение КАК Помещение
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗапасыИПотребностиОстатки.Номенклатура КАК Номенклатура,
	|			ЗапасыИПотребностиОстатки.Характеристика КАК Характеристика,
	|			СУММА(ЗапасыИПотребностиОстатки.ВНаличииОстаток) КАК ВНаличии,
	|			СУММА(ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток) КАК Резерв
	|		ИЗ
	|			РегистрНакопления.ЗапасыИПотребности.Остатки(
	|					,
	|					Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|						И Склад = &СкладТЗ) КАК ЗапасыИПотребностиОстатки
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗапасыИПотребностиОстатки.Номенклатура,
	|			ЗапасыИПотребностиОстатки.Характеристика) КАК РаспределениеЗапасов
	|		ПО ВТ_Номенклатура.Номенклатура = РаспределениеЗапасов.Номенклатура
	|			И ВТ_Номенклатура.Характеристика = РаспределениеЗапасов.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &БезКарты) КАК ЦенаБезКарты
	|		ПО ВТ_Номенклатура.Номенклатура = ЦенаБезКарты.Номенклатура
	|			И ВТ_Номенклатура.Характеристика = ЦенаБезКарты.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &ПоКарте) КАК ЦенаПоКарте
	|		ПО ВТ_Номенклатура.Номенклатура = ЦенаПоКарте.Номенклатура
	|			И ВТ_Номенклатура.Характеристика = ЦенаПоКарте.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &СкладТЗ) КАК ТоварыНаСкладахОстатки
	|		ПО ВТ_Номенклатура.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И ВТ_Номенклатура.Характеристика = ТоварыНаСкладахОстатки.Характеристика
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.Характеристика КАК Характеристика,
	|	ВТ.ТочкаПересчета КАК ТочкаПересчета,
	|	ВТ.Упаковка КАК Упаковка,
	|	ВТ.ОстаткиТЗ КАК ОстаткиТЗ,
	|	ВТ.ЦенаБезКарты КАК ЦенаБезКарты,
	|	ВТ.ЦенаПоКарте КАК ЦенаПоКарте,
	|	ВТ.ОстатокНаСкладе КАК ОстатокНаСкладе,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО ВТ.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|			И ВТ.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|			И ВТ.Помещение = РазмещениеНоменклатурыПоСкладскимЯчейкам.Помещение";
	
	Запрос.УстановитьПараметр("Штрихкод", ШтрихкодНоменклатуры);
	Запрос.УстановитьПараметр("СкладТЗ", Склад);
	Запрос.УстановитьПараметр("ПоКарте", Подразделение.ЦенаПоКарте);
    Запрос.УстановитьПараметр("БезКарты", Подразделение.ЦенаБезКарты);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(СтруктураДанныхОтвета,Выборка);
				
	КонецЕсли;	
	
	Возврат СтруктураДанныхОтвета;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьШтрихкод(Штрихкод1) 
	
	СсылкаНаЯчейку = ПолучитьЯчейкуПоШтрихкоду(Штрихкод1); 
	Если СсылкаНаЯчейку <> Неопределено Тогда
		ДоступныеЯчейки.Отбор.Элементы.Очистить();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДоступныеЯчейки, "Ссылка", СсылкаНаЯчейку, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	Иначе
		Сообщить("Ячейка не найдена!");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЯчейкуПоШтрихкоду(ШтрихКод1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкладскиеЯчейки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
	|ГДЕ
	|	СкладскиеЯчейки.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод1);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда	
		Возврат ВыборкаДетальныеЗаписи.Ссылка;   
	Иначе 
		Возврат Неопределено; 
	КонецЕсли;
КонецФункции



&НаСервере
Процедура ОтправитьСообщениеВБитриксНаСервере()
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		//Спр_ОтправкаДанныхЧерезRestApiБитрикса.ОтправитьСообщениеВБитрикс(Номенклатура,Сотрудник);
		//РегистрыСведений.ПроверкаЦенников.ЗаписатьСобытие(Номенклатура,Сотрудник);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеВБитрикс(Команда)
	ОтправитьСообщениеВБитриксНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьАдресКартинки(Номенклатура)
	
	ФайлКартинки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ФайлКартинки");
	Если ЗначениеЗаполнено(ФайлКартинки) тогда
		АдресКартинки = РаботаСФайлами.ДанныеФайла(ФайлКартинки, ЭтотОбъект.УникальныйИдентификатор).СсылкаНаДвоичныеДанныеФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеЗаменаИзображения(Команда)	
	Если ЗначениеЗаполнено(Номенклатура) Тогда  
		Замечание = "";
		Если ВвестиСтроку(Замечание, "Текст замечания (что не так)") Тогда
			Если Замечание <> "" Тогда
				ДопМодуль.ОтправитьСообщениеОЗаменеКартинки("Замените изображение у номенклатуры - ", Номенклатура, Замечание, Сотрудник); 
			Иначе
				 ОбщегоНазначенияКлиент.СообщитьПользователю("Для отправки запроса на замену картинки товара необходимо заполнить 'Текст замечания'!");
			КонецЕсли;
		Иначе 
			ОбщегоНазначенияКлиент.СообщитьПользователю("Для отправки запроса на замену картинки товара необходимо заполнить 'Текст замечания'!");
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура _ИзменитьЯчейку(Команда)
	Элементы.ГруппаСклад.Видимость = Ложь;
	Элементы.ВыборЯчейки.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеЯчейкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Элементы.ГруппаСклад.Видимость=Истина;
	Элементы.ВыборЯчейки.Видимость = Ложь;

	НоваяЯчейка = Элементы.ДоступныеЯчейки.ТекущиеДанные.Ссылка;
	Если ИзменитьЯчейку() Тогда
			Ячейка = ПолучитьЯчейку(Номенклатура,Склад);	
			Сообщить("Ячейка изменена!");
	Иначе
			Ячейка = "";
			Сообщить("При измененеии ячейки произошли проблемы! Ячейка не изменена!");
	КонецЕсли;
	ДоступныеЯчейки.Отбор.Элементы.Очистить();
КонецПроцедуры

Функция ИзменитьЯчейку()
	
	Записано = Ложь;
	
	Попытка
		НачатьТранзакцию();
		УстановитьПривилегированныйРежим(Истина);
		НаборЗаписей = РегистрыСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
		НаборЗаписей.Отбор.Склад.Установить(Склад);
		НаборЗаписей.Отбор.Ячейка.Установить(Ячейка);
		НаборЗаписей.Записать();
		
		МенеджерЗаписи = РегистрыСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Склад = Склад;
		МенеджерЗаписи.Ячейка = НоваяЯчейка;
		МенеджерЗаписи.Номенклатура = Номенклатура;
		МенеджерЗаписи.ОсновнаяЯчейка=Истина;
		
		МенеджерЗаписи.Записать();
		
		Записано = Истина;
		УстановитьПривилегированныйРежим(Ложь);
		ЗафиксироватьТранзакцию();
	Исключение
		Сообщить("Ошибка записи!");
		Записано = Ложь;
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Возврат Записано;	
	
КонецФункции

Функция ПолучитьЯчейку(НоменклатураСсылка,СкладСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка
		|ИЗ
		|	РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
		|ГДЕ
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура = &Номенклатура
		|	И РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад
		|	И РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА";
	
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураСсылка);
	Запрос.УстановитьПараметр("Склад", СкладСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Ячейка = ВыборкаДетальныеЗаписи.Ячейка;
	КонецЦикла;

    Возврат Ячейка;
КонецФункции

//+ для отладки
&НаКлиенте
Процедура СчитатьШтрихкод(Команда)
	#Если МобильныйКлиент Тогда
		Если СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
			ОповещениеСканирования = Новый ОписаниеОповещения("ОбработкаОтсканированногоШтрихкода",ЭтотОбъект);
			СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Scan code",ОповещениеСканирования,,ТипШтрихкода.Все);
		Иначе
			Сообщить("Сканирование не поддерживается!");
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтсканированногоШтрихкода(Штрихкод,Результат,Сообщение,ДопПараметры) Экспорт
	
	Если Результат и ЗначениеЗаполнено(Штрихкод) Тогда
		
		#Если МобильныйКлиент Тогда
		    СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		#КонецЕсли
		
		    Если ПустаяСтрока(Штрихкод) Тогда
				Элементы.Декорация1.Заголовок = "Не удалось прочитать штрихкод! Считайте штрихкод еще раз!";
				Элементы.Декорация1.ЦветТекста= WebЦвета.Красный;
				Элементы.Декорация1.Видимость = Истина;
				ЭтаФорма.Элементы.ГруппаГлавноеМеню.Видимость = Ложь;
				Возврат;
			КонецЕсли;
			
			СтруктураДанных = НоменклатураПоШтрихкоду(Штрихкод,Подразделение,Склад);
			
			Если ЗначениеЗаполнено(СтруктураДанных.Номенклатура)  Тогда
				Номенклатура = СтруктураДанных.Номенклатура; 
				Характеристика = СтруктураДанных.Характеристика; 
				ТочкаПересчета = СтруктураДанных.ТочкаПересчета;
				Упаковка =  СтруктураДанных.Упаковка; 
				ОстатокТЗ =  СтруктураДанных.ОстаткиТЗ;
				ОстатокНаСкладе = СтруктураДанных.ОстатокНаСкладе;
				Ячейка = СтруктураДанных.Ячейка;
				ЦенаПоКарте = СтруктураДанных.ЦенаПоКарте; 
				ЦенаБезКарты = СтруктураДанных.ЦенаБезКарты;
				Попытка
					ПолучитьАдресКартинки(Номенклатура);
				Исключение
				КонецПопытки;
				
				Элементы.Декорация1.Видимость = Ложь;
				Если ЭтоКладовщик Тогда
					Элементы.ГруппаСклад.Видимость=Истина;
				Иначе
					Элементы.ГруппаНоменклатура.Видимость=Истина;
				КонецЕсли;
			Иначе
				Элементы.Декорация1.Заголовок = "Не удалось прочитать штрихкод! Считайте штрихкод еще раз!";
				Элементы.Декорация1.ЦветТекста= WebЦвета.Красный;
				Если ЭтоКладовщик Тогда
					Элементы.ГруппаСклад.Видимость=Ложь;
				Иначе
					Элементы.ГруппаНоменклатура.Видимость=Ложь;
				КонецЕсли;
				Возврат;
			КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура _ВернутьсяКТЧ(Команда)
		
	Элементы.Декорация1.Заголовок = "Считайте штрихкод номенклатуры";
	Элементы.Декорация1.ЦветТекста= WebЦвета.Зеленый;
	Элементы.ГруппаСклад.Видимость=Ложь;
	Элементы.Декорация1.Видимость = Истина;
	
	ЭтаФорма.ОбновитьОтображениеДанных();

КонецПроцедуры


#Область Оповещения 
Функция СекцииСотрудника()
	Возврат Сотрудник.РабочиеУчастки.ВыгрузитьКолонку("РабочийУчасток");
КонецФункции


&НаКлиенте
Процедура Оповещения(Команда)
	Если ОповещенияИзОчереди Тогда
		ПричинаОтказа = "";
		ОповещенияПоСекцииПодключены = ПолучитьСостояниеОповещений();
				
		Если ПричинаОтказа = "" Тогда
			ОповещенияИзОчереди = Ложь;
			Сообщить("Оповещения отключены");
			Элементы.ГруппаСписокОчереди.Видимость = Ложь;
			ОтключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди");  
		Иначе
			Сообщить(ПричинаОтказа);
		КонецЕсли;
	Иначе
		ОповещенияИзОчереди = Истина;
		Сообщить("Оповещения подключены");
		Элементы.ГруппаСписокОчереди.Видимость = Истина; 
		ПодключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди", 10, Ложь);  
		ПроверкаЭлектроннойОчереди(); 
	КонецЕсли;
	ЗаписатьЗначениеОповещения();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСписокОчереди(Команда)
	Если КлиентовВОчереди > 0 Тогда   
		ОткрытьФорму("Обработка.РабочееМестоКладовщикаАльтерра.Форма.Форма", Новый Структура("Сотрудник,ИмяКоманды, ОткрытьОчередь",Сотрудник,"Отгрузка", Истина),ЭтотОбъект);  
	Иначе
		Сообщить("Список очереди пуст");
	КонецЕСли;	
КонецПроцедуры  

&НаСервере
Функция ЭлектроннаяОчередьНаСекции()
	Запрос = Новый запрос; 
	Запрос.Текст = "ВЫБРАТЬ
				 |	РабочиеУчастки.Ссылка КАК Ссылка,
				 |	РабочиеУчастки.ЭлектроннаяОчередь КАК ЭлектроннаяОчередь
				 |ИЗ
				 |	Справочник.РабочиеУчастки КАК РабочиеУчастки
				 |ГДЕ
				 |	РабочиеУчастки.Ссылка В(&Секции)
				 |	И РабочиеУчастки.ЭлектроннаяОчередь = Истина" ;
	Запрос.УстановитьПараметр("Секции", СекцииСотрудника()); 
	Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() Тогда 
		Возврат Истина; 
	Иначе 
		Возврат Ложь; 
	КонецЕсли;
	
КонецФункции 

&НаСервере
Функция ПолучитьСостояниеОповещений()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиРабочиеУчастки.Ссылка.ОповещенияИзОчереди КАК ОповещенияИзОчереди
		|ИЗ
		|	Справочник.Сотрудники.РабочиеУчастки КАК СотрудникиРабочиеУчастки
		|ГДЕ
		|	СотрудникиРабочиеУчастки.РабочийУчасток В(&РабочийУчасток)
		|	И СотрудникиРабочиеУчастки.Ссылка <> &Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	СотрудникиРабочиеУчастки.Ссылка.ОповещенияИзОчереди";
	
	Запрос.УстановитьПараметр("РабочийУчасток", СекцииСотрудника());
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 1 И Результат.Найти(Истина, "ОповещенияИзОчереди") = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции 


&НаКлиенте
Процедура ПроверкаЭлектроннойОчереди() Экспорт
	ОбновитьСписокОчереди();  
КонецПроцедуры   

&НаСервере
Процедура ОбновитьСписокОчереди() 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭлектроннаяОчередьКлиентов.Документ КАК Документ,
	|	ЭлектроннаяОчередьКлиентов.ПолучательУведомления КАК Получатель
	|ИЗ
	|	РегистрСведений.ЭлектроннаяОчередьКлиентов КАК ЭлектроннаяОчередьКлиентов 
	|ГДЕ
	|   ЭлектроннаяОчередьКлиентов.ТребуетсяОповещениеКладовщику = Истина 
	|	И ЭлектроннаяОчередьКлиентов.ПолучательУведомления В (&Секции)   
	|	И не ЭлектроннаяОчередьКлиентов.Состояние = &Статус
	|
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭлектроннаяОчередьКлиентов.Документ,
	|	ЭлектроннаяОчередьКлиентов.ПолучательУведомления";
	
	
	Запрос.УстановитьПараметр("Секции", СекцииСотрудника());
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЭлектроннойОчереди.Выдан);
    РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда
		КлиентовВОчереди = РезультатЗапроса.Выбрать().Количество(); 
	Иначе
       КлиентовВОчереди = 0;
   	КонецЕсли;  
КонецПроцедуры 	

&НаСервере
Процедура ЗаписатьЗначениеОповещения() 
	УстановитьПривилегированныйРежим(Истина);
	ОбъектСотрудник = Сотрудник.ПолучитьОбъект();
	ОбъектСотрудник.ОповещенияИзОчереди = ОповещенияИзОчереди;
	ОбъектСотрудник.Записать();
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

#КонецОбласти


//- для отладки
